joshieyu/STM32Firmware/H755Custom/H755Custom.ioc
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,AudioMode-SAI_A_MasterWithClock,AudioFrequency-SAI_A_MasterWithClock,MonoStereoMode-SAI_A_MasterWithClock,FrameLength-SAI_A_MasterWithClock,FrameLength-SAI_B_SyncSlave,DataSize-SAI_A_MasterWithClock,ActiveFrameLength-SAI_A_MasterWithClock,ActiveFrameLength-SAI_B_SyncSlave,SlotNumber-SAI_A_MasterWithClock,VirtualSlotActive-SAI_A_MasterWithClock,SlotActive-SAI_A_MasterWithClock,DataSize-SAI_B_SyncSlave,SlotNumber-SAI_B_SyncSlave,VirtualSlotActive-SAI_B_SyncSlave,SlotActive-SAI_B_SyncSlave,SlotSize-SAI_A_MasterWithClock,SlotSize-SAI_B_SyncSlave
SAI1.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
SAI1.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
SAI1.MonoStereoMode-SAI_A_MasterWithClock=SAI_STEREOMODE
SAI1.RealAudioFreq-SAI_A_MasterWithClock=44.117 KHz
SAI1.SlotActive-SAI_A_MasterWithClock=0x0000FFFF
SAI1.SlotActive-SAI_B_SyncSlave=0x0000FFFF
SAI1.SlotNumber-SAI_A_MasterWithClock=8
SAI1.SlotNumber-SAI_B_SyncSlave=8
SAI1.SlotSize-SAI_A_MasterWithClock=SAI_SLOTSIZE_32B
SAI1.SlotSize-SAI_B_SyncSlave=SAI_SLOTSIZE_32B
SAI1.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
SAI1.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
SAI1.VirtualSlotActive-SAI_A_MasterWithClock=SAI_SLOTACTIVE_ALL
SAI1.VirtualSlotActive-SAI_B_SyncSlave=SAI_SLOTACTIVE_ALL
SAI2.ActiveFrameLength-SAI_B_Master=32
SAI2.AudioFrequency-SAI_B_Master=SAI_AUDIO_FREQUENCY_44K
SAI2.DataSize-SAI_B_Master=SAI_DATASIZE_24
SAI2.ErrorAudioFreq-SAI_B_Master=0.03 %
SAI2.FSDefinition-SAI_B_Master=SAI_FS_CHANNEL_IDENTIFICATION
SAI2.FSPolarity-SAI_B_Master=SAI_FS_ACTIVE_HIGH
SAI2.FrameLength-SAI_B_Master=64
SAI2.IPParameters=Instance-SAI_B_Master,VirtualMode-SAI_B_Master,MClockEnable-SAI_B_Master,RealAudioFreq-SAI_B_Master,ErrorAudioFreq-SAI_B_Master,FrameLength-SAI_B_Master,DataSize-SAI_B_Master,ActiveFrameLength-SAI_B_Master,FSDefinition-SAI_B_Master,SlotNumber-SAI_B_Master,FSPolarity-SAI_B_Master,AudioFrequency-SAI_B_Master,VirtualSlotActive-SAI_B_Master,SlotActive-SAI_B_Master,SlotSize-SAI_B_Master
SAI2.Instance-SAI_B_Master=SAI$Index_Block_B
SAI2.MClockEnable-SAI_B_Master=SAI_MASTERCLOCK_DISABLE
SAI2.RealAudioFreq-SAI_B_Master=44.117 KHz
SAI2.SlotActive-SAI_B_Master=0x0000FFFF
SAI2.SlotNumber-SAI_B_Master=2
SAI2.SlotSize-SAI_B_Master=SAI_SLOTSIZE_32B
SAI2.VirtualMode-SAI_B_Master=VM_MASTER
SAI2.VirtualSlotActive-SAI_B_Master=SAI_SLOTACTIVE_ALL
SPI3.CalculateBaudRate=40.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualType=VM_MASTER
SYS.userName=SYS_M7
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_SYS_M4_VS_Systick.Mode=SysTick
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
isbadioc=false
